questions = [
    {
        "question": "מה שם בית הספר שלכם?",
        "type": "open",  # שאלה פתוחה
        "feedback": "מעולה, תודה רבה! עכשיו נוכל להתחיל בשיחה."
    },
    {
        "question": "בנקודת זמן זאת, לפני תחילת התוכנית, אשמח לדעת מה אתם חושבים שהסיכוי שלכם להשתלב בעתיד בתחום ההייטק:",
        "type": "closed",  # שאלה סגורה
        "options": ["אין סיכוי בעולם", "סיכוי נמוך", "יש מצב טוב", "ברור שכן!"],
        "feedbacks": ["הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת.",
                      "הבנתי. תודה על התשובה. אשמח שתספרו לי על זה עוד קצת."]
    },
    {
        "question": "למה זה המצב לדעתכם?",
        "type": "open",  # שאלה פתוחה
        "feedback": "תודה, אני חושב שזה יהיה רעיון טוב לדבר על זה עם המורה שלך או מישהו מבוגר בחיים שלכם שאתם סומכים עליו, ותשתפו אותו במחשבות האלה."
    },
    {
        "question": "אשמח אם תדרגו את השיחה:",
        "type": "closed",  # שאלה סגורה
        "options": ["1", "2", "3", "4", "5"],
        "feedbacks": ["תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!", "תודה על הדירוג!"]
    }
]
